var удаљености = [];

for (var i = 0; i < 61; i++) {
	удаљености.push([]);

	for (var j = 0; j < 61; j++) {
		удаљености[i].push(i === j ? 0 : null);
	}
}

// Niš istok - Niš Malča
удаљености[56][57] = 7.8;
удаљености[57][56] = 8.2;

// Niš istok - Niš sever
удаљености[56][55] = 7.1;
удаљености[55][56] = 8.8;

// Niš istok - Niš jug
удаљености[56][29] = 14.7;
удаљености[29][56] = 13.1;

// Niš istok - Doljevac
удаљености[56][30] = 30.1;
удаљености[30][56] = 29.5;

// Niš istok - Subotica
удаљености[56][0] = 411;
удаљености[0][56] = 413;

// Niš istok - Beograd
удаљености[56][11] = 215;
удаљености[11][56] = 216;

// Niš istok - Aleksinac
удаљености[56][28] = 31.8;
удаљености[28][56] = 31.1;

// Niš istok - Aleksinački rudnici
удаљености[56][27] = 35.6;
удаљености[27][56] = 36.8;

// Niš istok - Batočina
удаљености[56][21] = 126;
удаљености[21][56] = 127;

// Niš istok - Bela Palanka
удаљености[56][58] = 37;
удаљености[58][56] = 37;

// Niš istok - Brestovac
удаљености[56][31] = 36.3;
удаљености[31][56] = 35.8;

// Niš istok - Preševo
удаљености[56][40] = 154;
удаљености[40][56] = 153;

// Niš istok - Dimitrovgrad
удаљености[56][41] = 86.3;
удаљености[41][56] = 86.2;

// Niš istok - Grdelica
удаљености[56][34] = 71.1;
удаљености[34][56] = 69.9;

// Niš istok - Jagodina
удаљености[56][22] = 105;
удаљености[22][56] = 105;

// Niš istok - Kolari
удаљености[56][15] = 184;
удаљености[15][56] = 184;

// Niš istok - Kuzmin
удаљености[56][44] = 327;
удаљености[44][56] = 328;

// Niš istok - Leskovac centar
удаљености[56][32] = 43.6;
удаљености[32][56] = 42.9;

// Niš istok - Leskovac jug
удаљености[56][33] = 59.8;
удаљености[33][56] = 59.8;

// Niš istok - Mali Požarevac
удаљености[56][12] = 203;
удаљености[12][56] = 203;

// Niš istok - Markovac
удаљености[56][19] = 137;
удаљености[19][56] = 137;

// Niš istok - Merošina
удаљености[56][54] = 19.6;
удаљености[54][56] = 19;

// Niš istok - Paraćin
удаљености[56][24] = 81.1;
удаљености[24][56] = 84.8;

// Niš istok - Pirot istok
удаљености[56][60] = 61.1;
удаљености[60][56] = 60.8;

// Niš istok - Pirot zapad
удаљености[56][59] = 71.7;
удаљености[59][56] = 71.2;

// Niš istok - Pojate
удаљености[56][25] = 69.3;
удаљености[25][56] = 69.2;

// Niš istok - Požarevac
удаљености[56][17] = 177;
удаљености[17][56] = 178;

// Niš istok - Predejane
удаљености[56][35] = 81.3;
удаљености[35][56] = 80.3;

// Niš istok - Ražanj
удаљености[56][26] = 55.7;
удаљености[26][56] = 57.1;

// Niš istok - Smederevo
удаљености[56][16] = 179;
удаљености[16][56] = 180;

// Niš istok - Umčari
удаљености[56][13] = 196;
удаљености[13][56] = 197;

// Niš istok - Velika Plana
удаљености[56][18] = 149;
удаљености[18][56] = 149;

// Niš istok - Vladičin Han
удаљености[56][36] = 95.1;
удаљености[36][56] = 94.8;

// Niš istok - Vranje
удаљености[56][37] = 118;
удаљености[37][56] = 117;

// Niš istok - Vodanj
удаљености[56][14] = 190;
удаљености[14][56] = 191;

// Niš istok - Ćuprija
удаљености[56][23] = 91.7;
удаљености[23][56] = 91.7;

// Niš istok - Bujanovac sever
удаљености[56][38] = 132;
удаљености[38][56] = 131;

// Niš istok - Bujanovac jug
удаљености[56][39] = 135;
удаљености[39][56] = 135;

// Niš sever - Niš Malča
удаљености[55][57] = 15.6;
удаљености[57][55] = 14.4;

// Niš sever - Niš jug
удаљености[55][29] = 8.1;
удаљености[29][55] = 6.2;

// Niš sever - Merošina
удаљености[55][54] = 13;
удаљености[54][55] = 12;

// Niš sever - Doljevac
удаљености[55][30] = 23.6;
удаљености[30][55] = 22.6;

// Niš sever - Brestovac
удаљености[55][31] = 29.6;
удаљености[31][55] = 28.6;

// Niš sever - Aleksinac
удаљености[55][28] = 24.6;
удаљености[28][55] = 24.8;

// Niš sever - Aleksinački rudnici
удаљености[55][27] = 29.1;
удаљености[27][55] = 29.8;

// Niš sever - Batočina
удаљености[55][21] = 120;
удаљености[21][55] = 120;

// Niš sever - Bela Palanka
удаљености[55][58] = 44.4;
удаљености[58][55] = 43.6;

// Niš sever - Beograd
удаљености[55][11] = 209;
удаљености[11][55] = 209;

// Niš sever - Bujanovac jug
удаљености[55][39] = 129;
удаљености[39][55] = 128;

// Niš sever - Bujanovac sever
удаљености[55][38] = 125;
удаљености[38][55] = 124;

// Niš sever - Dimitrovgrad
удаљености[55][41] = 93.7;
удаљености[41][55] = 92.8;

// Niš sever - Grdelica
удаљености[55][34] = 64.5;
удаљености[34][55] = 62.9;

// Niš sever - Jagodina
удаљености[55][22] = 98.8;
удаљености[22][55] = 97.9;

// Niš sever - Kolari
удаљености[55][15] = 177;
удаљености[15][55] = 177;

// Niš sever - Lapovo
удаљености[55][20] = 123;
удаљености[20][55] = 124;

// Niš sever - Leskovac centar
удаљености[55][32] = 37;
удаљености[32][55] = 35.9;

// Niš sever - Leskovac jug
удаљености[55][33] = 53.3;
удаљености[33][55] = 52.8;

// Niš sever - Mali Požarevac
удаљености[55][12] = 197;
удаљености[12][55] = 196;

// Niš sever - Markovac
удаљености[55][19] = 130;
удаљености[19][55] = 130;

// Niš sever - Paraćin
удаљености[55][24] = 74.4;
удаљености[24][55] = 74.1;

// Niš sever - Pirot istok
удаљености[55][60] = 79.8;
удаљености[60][55] = 77.6;

// Niš sever - Pirot zapad
удаљености[55][59] = 68.5;
удаљености[59][55] = 67.4;

// Niš sever - Pojate
удаљености[55][25] = 62.8;
удаљености[25][55] = 62.2;

// Niš sever - Požarevac
удаљености[55][17] = 170;
удаљености[17][55] = 171;

// Niš sever - Predejane
удаљености[55][35] = 74.8;
удаљености[35][55] = 73.2;

// Niš sever - Preševo
удаљености[55][40] = 148;
удаљености[40][55] = 146;

// Niš sever - Ražanj
удаљености[55][26] = 49.2;
удаљености[26][55] = 50.1;

// Niš sever - Smederevo
удаљености[55][16] = 172;
удаљености[16][55] = 173;

// Niš sever - Umčari
удаљености[55][13] = 190;
удаљености[13][55] = 190;

// Niš sever - Velika Plana 
удаљености[55][18] = 142;
удаљености[18][55] = 142;

// Niš sever - Vladičin Han
удаљености[55][36] = 88.6;
удаљености[36][55] = 87.8;

// Niš sever - Vodanj
удаљености[55][14] = 184;
удаљености[14][55] = 184;

// Niš sever - Vranje
удаљености[55][37] = 112;
удаљености[37][55] = 111;

// Niš sever - Ćuprija
удаљености[55][23] = 85.1;
удаљености[23][55] = 84.7;

// Doljevac - Beograd
удаљености[30][11] = 226;
удаљености[11][30] = 226;

// Doljevac - Mali Požarevac
удаљености[30][12] = 214;
удаљености[12][30] = 213;

// Doljevac - Umčari
удаљености[30][13] = 207;
удаљености[13][30] = 207;

// Doljevac - Vodanj
удаљености[30][14] = 201;
удаљености[14][30] = 200;

// Doljevac - Kolari
удаљености[30][15] = 195;
удаљености[15][30] = 194;

// Doljevac - Smederevo
удаљености[30][16] = 190;
удаљености[16][30] = 189;

// Doljevac - Požarevac
удаљености[30][17] = 188;
удаљености[17][30] = 188;

// Doljevac - Velika Plana
удаљености[30][18] = 159;
удаљености[18][30] = 159;

// Doljevac - Markovac
удаљености[30][19] = 147;
удаљености[19][30] = 147;

// Doljevac - Lapovo
удаљености[30][20] = 141;
удаљености[20][30] = 141;

// Doljevac - Batočina
удаљености[30][21] = 137;
удаљености[21][30] = 137;

// Doljevac - Jagodina
удаљености[30][22] = 116;
удаљености[22][30] = 115;

// Doljevac - Ćuprija
удаљености[30][23] = 102;
удаљености[23][30] = 102;

// Doljevac - Paraćin
удаљености[30][24] = 91.6;
удаљености[24][30] = 91;

// Doljevac - Pojate
удаљености[30][25] = 80;
удаљености[25][30] = 79.1;

// Doljevac - Ražanj
удаљености[30][26] = 66.4;
удаљености[26][30] = 66.9;

// Doljevac - Aleksinački rudnici
удаљености[30][27] = 46.2;
удаљености[27][30] = 46.7;

// Doljevac - Aleksinac
удаљености[30][28] = 41.8;
удаљености[28][30] = 41.7;

// Doljevac - Niš jug
удаљености[30][29] = 16.8;
удаљености[29][30] = 16.9;

// Doljevac - Brestovac
удаљености[30][31] = 6.3;
удаљености[31][30] = 7.1;

// Doljevac - Leskovac centar
удаљености[30][32] = 13.8;
удаљености[32][30] = 14.4;

// Doljevac - Leskovac jug
удаљености[30][33] = 29.9;
удаљености[33][30] = 31.2;

// Doljevac - Grdelica
удаљености[30][34] = 41.3;
удаљености[34][30] = 41.4;

// Doljevac - Predejane
удаљености[30][35] = 51.6;
удаљености[35][30] = 51.7;

// Doljevac - Vladičin Han
удаљености[30][36] = 65.3;
удаљености[36][30] = 66.3;

// Doljevac - Vranje
удаљености[30][37] = 88.3;
удаљености[37][30] = 89;

// Doljevac - Bujanovac sever
удаљености[30][38] = 102;
удаљености[38][30] = 103;

// Doljevac - Bujanovac jug
удаљености[30][39] = 105;
удаљености[39][30] = 107;

// Doljevac - Preševo
удаљености[30][40] = 124;
удаљености[40][30] = 125;

// Doljevac - Dimitrovgrad
удаљености[30][41] = 115;
удаљености[41][30] = 116;

// Doljevac - Merošina
удаљености[30][54] = 11.8;
удаљености[54][30] = 11;

// Doljevac - Niš Malča
удаљености[30][57] = 36.7;
удаљености[57][30] = 36.7;

// Doljevac - Bela Palanka
удаљености[30][58] = 65.5;
удаљености[58][30] = 66.7;

// Doljevac - Pirot zapad
удаљености[30][59] = 89.6;
удаљености[59][30] = 90.6;

// Doljevac - Pirot istok
удаљености[30][60] = 101;
удаљености[06][30] = 101;
